In [2]:
import pandas as pd

In [3]:
# 1)Прочесть с помощью pandas файл california_housing_test.csv
df = pd.read_csv("california_housing_test.csv", index_col=0)

In [4]:
# 2)Посмотреть сколько в нем строк и столбцов
df.shape

(3402, 8)

In [5]:
# 3)Определить какой тип данных имеют столбцы
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3402 entries, 1 to 3402
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3402 non-null   float64
 1   latitude            3402 non-null   float64
 2   housing_median_age  3402 non-null   int64
 3   total_rooms         3402 non-null   int64
 4   total_bedrooms      3402 non-null   int64
 5   population          3402 non-null   int64
 6   households          3402 non-null   int64
 7   median_income       3402 non-null   float64
dtypes: float64(3), int64(5)
memory usage: 239.2 KB

In [6]:
# 4)Показать longitude где housing_median_age < 35
df["longitude"][df["housing_median_age"] < 35]

1      -117.66
2      -117.07
3      -117.91
4      -117.19
5      -119.58
         ...
3393   -122.10
3394   -117.52
3396   -117.01
3399   -117.88
3400   -118.32
Name: longitude, Length: 2216, dtype: float64

In [7]:
# 5)Показать столбцы longitude и latitude
df[["longitude", "latitude"]]

      longitude  latitude
1       -117.66     35.60
2       -117.07     32.71
3       -117.91     33.61
4       -117.19     34.05
5       -119.58     36.83
...         ...       ...
3398    -118.33     34.09
3399    -117.88     34.09
3400    -118.32     34.26
3401    -118.12     33.80
3402    -118.19     33.78

[3402 rows x 2 columns]

In [8]:
# 6)Выбрать данные где total_rooms < 2000 и population > 1500
df[(df["total_rooms"] < 2000) & (df["population"] > 1500)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income
13,-118.21,33.79,39,1598,458,1691,399,2.3605
19,-122.41,37.80,30,1821,738,1648,684,0.8836
70,-117.93,34.01,33,1733,361,1757,375,4.2266
101,-121.24,36.33,13,1642,418,1534,388,3.1222
121,-118.22,33.90,35,1649,424,1786,388,1.4091
...,...,...,...,...,...,...,...,...
3152,-118.36,34.22,37,1512,348,1545,351,3.7663
3173,-117.89,33.74,32,1562,365,2145,347,2.9167
3216,-118.23,33.92,32,1735,430,1699,386,1.1793
3333,-119.76,36.71,29,1745,441,1530,391,1.5611
3373,-118.20,33.99,35,1705,523,2252,508,2.3421

In [9]:
# 7)Определить какое максимальное и минимальное значение population
df.population.describe()[["min","max"]]

min        8.0
max    35682.0
Name: population, dtype: float64

In [10]:
# 8)(Доп) Показать максимальное longitude, где median_income > 3
df.loc[df["median_income"] > 3, "longitude"].max()

-115.37

In [11]:
# 9)(Доп) Узнать какая максимальная total_bedrooms при минимальном значении households
df["total_bedrooms"][df["households"] == df["households"].min()].max()

7